tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "mas-cli/tap"
tap "sanemat/font"
tap "songmu/tap"
tap "supabase/tap"
tap "weaveworks/tap"
brew "anyenv"
brew "awscli"
brew "deck"
brew "deno"
brew "emacs"
brew "figlet"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gibo"
brew "git"
brew "gradle"
brew "helm"
brew "helmfile"
brew "hub"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libheif"
brew "libraw"
brew "libxmlsec1"
brew "nghttp2"
brew "nkf"
brew "nmap"
brew "node"
brew "oath-toolkit"
brew "okteto"
brew "pnpm"
brew "python@3.10"
brew "silicon"
brew "tcl-tk"
brew "tig"
brew "tree"
brew "hashicorp/tap/terraform"
brew "mas-cli/tap/mas"
brew "songmu/tap/laminate"
brew "weaveworks/tap/eksctl"
cask "adobe-acrobat-reader"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logi-options+"
cask "notion"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "slack"
cask "switchhosts"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"
vscode "anthropic.claude-code"
vscode "atsushieno.language-review"
vscode "bierner.markdown-mermaid"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dineug.vuerd-vscode"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "jebbs.plantuml"
vscode "jetbrains.jetbrains-ai-assistant"
vscode "mathiasfrohlich.kotlin"
vscode "maximilionus.dark-shell"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rokoroku.vscode-theme-darcula"
vscode "romanpeshkov.vscode-text-tables"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "tuttieee.emacs-mcx"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
