tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/core"
tap "sanemat/font"
tap "weaveworks/tap"
brew "anyenv"
brew "connect"
brew "dcraw"
brew "deno"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "figlet"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gibo"
brew "git"
brew "gobject-introspection"
brew "gradle"
brew "helm"
brew "helmfile"
brew "hub"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libxmlsec1"
brew "nghttp2"
brew "nkf"
brew "nmap"
brew "node"
brew "oath-toolkit"
brew "okteto"
brew "python@3.10"
brew "tcl-tk"
brew "tig"
brew "tree"
brew "ufraw"
brew "hashicorp/tap/terraform"
brew "weaveworks/tap/eksctl"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "iterm2"
cask "postman"
cask "tableplus"
cask "notion"
cask "google-japanese-ime"
cask "google-chrome"
cask "google-drive"
cask "firefox"
cask "1password"
cask "1password-cli"
cask "slack"
cask "zoom"
cask "figma"
cask "miro"
cask "temurin"
cask "tunnelblick"
cask "kindle"
cask "switchhosts"
cask "docker"
cask "rectangle"
cask "logi-options+"
vscode "atsushieno.language-review"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "dineug.vuerd-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "jebbs.plantuml"
vscode "mathiasfrohlich.kotlin"
vscode "maximilionus.dark-shell"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rokoroku.vscode-theme-darcula"
vscode "romanpeshkov.vscode-text-tables"
vscode "tuttieee.emacs-mcx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
